---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForWallFailures.CouldNotAdjustWallPartsAtJoin
source: html/f9c79e0f-36e3-a4f2-0b19-4e54ef580d7f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForWallFailures.CouldNotAdjustWallPartsAtJoin Property

Failed to extend or trim some layer at an end join

## Syntax (C#)
```csharp
public static FailureDefinitionId CouldNotAdjustWallPartsAtJoin { get; }
```